CSI API ETABS v1
cPropMaterial.GetMPAnisotropic Method
 Retrieves the mechanical properties for a material with an anisotropic directional symmetry type.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMPAnisotropic(
	string Name,
	ref double[] E,
	ref double[] U,
	ref double[] A,
	ref double[] G,
	double Temp = 0
)
Function GetMPAnisotropic (
	Name As String,
	ByRef E As Double(),
	ByRef U As Double(),
	ByRef A As Double(),
	ByRef G As Double(),
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim E As Double()
Dim U As Double()
Dim A As Double()
Dim G As Double()
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.GetMPAnisotropic(Name,
	E, U, A, G, Temp)
int GetMPAnisotropic(
	String^ Name,
	array<double>^% E,
	array<double>^% U,
	array<double>^% A,
	array<double>^% G,
	double Temp = 0
)
abstract GetMPAnisotropic :
        Name : string *
        E : float[] byref *
        U : float[] byref *
        A : float[] byref *
        G : float[] byref *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
E
Type: System.Double[]
This is an array that includes the modulus of elasticity.
Value | Term
e(0) | E1 [F/L2]
e(1) | E2 [F/L2]
e(2) | E3 [F/L2]
U
Type: System.Double[]
This is an array that includes poisson’s ratio.
Value | Term
u(0) | U12
u(1) | U13
u(2) | U23
u(3) | U14
u(4) | U24
u(5) | U34
u(6) | U15
u(7) | U25
u(8) | U35
u(9) | U45
u(10) | U16
u(11) | U26
u(12) | U36
u(13) | U46
u(14) | U56
A
Type: System.Double[]
This is an array that includes the thermal coefficient.
Value | Term
a(0) | A1 [1/T]
a(1) | A2 [1/T]
a(2) | A3 [1/T]
a(3) | A12 [1/T]
a(4) | A13 [1/T]
a(5) | A23 [1/T]
G
Type: System.Double[]
This is an array that includes the shear modulus.
Value | Term
g(0) | G12 [F/L2]
g(1) | G13 [F/L2]
g(2) | G23 [F/L2]
Temp (Optional)
Type: System.Double
The temperature at which the specified data is to be retrieved. The temperature must have been previously defined for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value. The function returns an error if the symmetry type of the specified material is not anisotropic.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyE() As Double
       Dim MyU() As Double
       Dim MyA() As Double
       Dim MyG() As Double
       Dim e() As Double
       Dim u() As Double
       Dim a() As Double
       Dim g() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'assign anisotropic mechanical properties
       ReDim MyE(2)
       ReDim MyU(14)
       ReDim MyA(6)
       ReDim MyG(2)
       MyE(0)=30000
       MyE(1)=10000
       MyE(2)=2000
       MyU(0)=0.2
       MyU(1)=0.05
       MyU(2)=0.1
       MyU(3)=0
       MyU(4)=0
       MyU(5)=0
       MyU(6)=0
       MyU(7)=0
       MyU(8)=0.01
       MyU(9)=0
       MyU(10)=0
       MyU(11)=0
       MyU(12)=0
       MyU(13)=0
       MyU(14)=0
       MyA(0)=6.5E-6
       MyA(1)=6.5E-6
       MyA(2)=6.5E-6
       MyA(3)=6.5E-6
       MyA(4)=6.5E-6
       MyA(5)=6.5E-6
       MyG(0)=1500
       MyG(1)=2500
       MyG(2)=8700
       ret = SapModel.PropMaterial.SetMPAnisotropic("Steel", MyE, MyU, MyA, MyG)
   'get anisotropic mechanical properties
       ret = SapModel.PropMaterial.GetMPAnisotropic("Steel", e, u, a, g)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace